# عملگر ها در پایتون 

xplus = 15 + 6  # عملگر + برای جمع اعداد

xm = 14 - 6  # عملگر - برای تفریق اعداد

xz = 2 * 8   # عملگر * برای ضرب اعداد

xt = 8 / 2  # عملگر / برای تقسیم اعداد

xtkh = 12 // 2  # عملگر // برای دریافت خارج قسمت تقسیم

xtb = 8 % 2  # عملگر % برای دریافت باقیمانده تقسیم

yt = 2** 3  # عملگر ** برای توان اعداد




# عملگر های مقایسه در پایتون 

'همیشه جواب آنها یک بولین است'

b = 50 > 40  # عدد 50 بزرگتر از 40 است

k = 78 < 100  # عدد 78 کوچک تر از 100 است

bm = b >= 8  # بی بزرگتر و مساوی 8 است 

km = b <= 7  # بی کوچک تر و مساوی 7 است

m = b == k  # بی مساوی کا است 

nm = b != k  # بی مساوی کا نیست




# عملگر های منطقی 

'اگر هر دو درست باشد جواب درست است و در غیر اینصورت غلط است'

and_ = (b < m) and (m == k)  # and 

s = True  # not
print (not s)

xl = (m > 3) or (4 > 6)  # or




# عملگر های انتساب 

e = 8   # عملگر = برای انتساب مستقیم 

e += 59  # عملگر =+ برای جمع و انتساب

e -= 65  # عملگر =- برای تفریق و انتساب

e *= 45  # عملگر =* برای ضرب و انتساب 

e /= 56  # عملگر =/ برای تقسیم و انتساب

e //= 45  # عملگر =// برای تقسیم صحیح و انتساب

e %= 2 # عملگر =% برای باقیمانده و انتساب

e **= 5  # عملگر =** برای توان و انتساب




# اپراتور های شناسایی

sh = m is e  # برای بررسی اینکه آیا دو شی یکسان اند

shn = m is not e  # برای بررسی اینکه آیا دو شی یکسان نیستند




# اپراتور های عضویت

oz = 5 in [7,8,9,5]  # برای بررسی عضویت

ozn = 4 [5,6,9,8]  # برای بررسی عدم عضویت























