'''

# متغییر 

x = 6556

f = 'mdce'

'''

'''

# نام های ممنوعه متغیر 

class = 55  # کلمات رزرو شده 

variable@ = 63 #  علامت های خاص مثل !@#$%^&*)(_+=) ممنوع هستند  

'''

'''

# تمارین نوع داده

a = 5  # Integer

b = 6.3  # Float

c = 'mohamad'  # Ftring

d = True , False  #Boolean

'''

'''

# تابع تایپ برای تشخیص نوع داده و نمایش نتیجه آن به کمک تابع پرینت

x = 29

print (type(x))  # تابع پرینت یک تابع برای چاپ روی صفحه نمایش

'''

'''

#  تبدیل نوع داده با استفاده از توابع آنها

x = 5  # نوع داده اینتیجر

y = 5.68  # نوع داده فلوات 

print (int(y)) # تبدیل داده به اینتیجر 

print (float(x))  # تبدیل داده به فلوات 

print (str(x))  # تبدیل داده  به استرینگ 

print (bool(x))  # تبدیل داده به بولین

'''