# رشته ها اندیس دارند و با استفاده از آنها میتوان کار های مختلفی انجام داد 

s = 'Hello world' # H : 0 , e : 1 , l : 2 , ... , d : 10




# برای دسترسی به عضوی از رشته :

t = s[4] # خروجی : 'o'




# برای برش بخشی از رشته و دسترسی به آن :

tb = s[4:8] # خروجی : 'o wo'    




# برای برش از بخشی به بعد 

tba = s[4 : ] # خروجی : 'o world'

'or s [4 : 11]'




# اندیس ها منفی هم دارند

s2 = 'hello'  # o : -1 , l : -2 , ... , h :-5




# برای برش گام هم وجود دارد

s3 = 'salam khobi ?' 

tbg = s3[2 : 12 : 2] # خروجی : 'lmkoi'




# برش گام دار برای معکوس کردن 

s4 = 'mohamad' 

sm = s4[ : :-1]  # خروجی : 'damahom'




# عملگر های حسابی رشته * و + است

'مثال برای جمع دو رشته'


s5 = 'moha'

s6 = 'mad ast'

sj = s5 + s6[ : 3] # خروجی : 'mohamad'



'مثال برای ضرب'

'نکته : رشته فقط در یک عدد ضر میشود'

s7 = 'salam'

sz = s7 * 3 # خروجی : 'salamsalamsalam'





# رشته نوع داده تغییر ناپذیر است

s8 = 'ali akbar'

s8[5] = 'm'  # خروجی ارور است 


