
# متغیر 

x = 6556

f = 'mdce'




# نام های ممنوعه متغیر 

class = 55  # کلمات رزرو شده 

variable@ = 63 #  علامت های خاص مثل !@#$%^&*)(_+=) ممنوع هستند  




# تمارین نوع داده

a = 5  # Integer

b = 6.3  # Float

c = 'mohamad'  # Ftring

d = True , False  #Boolean




# تابع تایپ برای تشخیص نوع داده و نمایش نتیجه آن به کمک تابع پرینت

ty = 29

print (type(x))  # تابع پرینت یک تابع برای چاپ روی صفحه نمایش




#  تبدیل نوع داده با استفاده از توابع آنها

xi = 5  # نوع داده اینتیجر

yf = 5.68  # نوع داده فلوات 

print (int(yf)) # تبدیل داده به اینتیجر 

print (float(xi))  # تبدیل داده به فلوات 

print (str(xi))  # تبدیل داده  به استرینگ 

print (bool(xi))  # تبدیل داده به بولین

